{
    "1": {
        "question": "한 변의 길이가 12cm인 정삼각형과 둘레의 길이가 같은 정사각형이 있습니다. 이 정사각형의 한 변의 길이는 몇 cm입니까?"
    },
    "2": {
        "question": "한 변의 길이가 15cm인 정삼각형과 둘레의 길이가 같은 정오각형이 있습니다. 이 정오각형의 한 변의 길이는 몇 cm입니까?"
    },
    "3": {
        "question": "한 변의 길이가 10cm인 정삼각형과 둘레의 길이가 같은 정육각형이 있습니다. 이 정육각형의 한 변의 길이는 몇 cm입니까?"
    },
    "4": {
        "question": "한 변의 길이가 35cm인 정삼각형과 둘레의 길이가 같은 정칠각형이 있습니다. 이 정칠각형의 한 변의 길이는 몇 cm입니까?"
    },
    "5": {
        "question": "한 변의 길이가 40cm인 정삼각형과 둘레의 길이가 같은 정팔각형이 있습니다. 이 정팔각형의 한 변의 길이는 몇 cm입니까?"
    },
    "6": {
        "question": "한 변의 길이가 15cm인 정삼각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "7": {
        "question": "한 변의 길이가 50cm인 정삼각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "8": {
        "question": "한 변의 길이가 25cm인 정사각형과 둘레의 길이가 같은 정오각형이 있습니다. 이 정오각형의 한 변의 길이는 몇 cm입니까?"
    },
    "9": {
        "question": "한 변의 길이가 9cm인 정사각형과 둘레의 길이가 같은 정육각형이 있습니다. 이 정육각형의 한 변의 길이는 몇 cm입니까?"
    },
    "10": {
        "question": "한 변의 길이가 28cm인 정사각형과 둘레의 길이가 같은 정칠각형이 있습니다. 이 정칠각형의 한 변의 길이는 몇 cm입니까?"
    },
    "11": {
        "question": "한 변의 길이가 12cm인 정사각형과 둘레의 길이가 같은 정팔각형이 있습니다. 이 정팔각형의 한 변의 길이는 몇 cm입니까?"
    },
    "12": {
        "question": "한 변의 길이가 54cm인 정사각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "13": {
        "question": "한 변의 길이가 15cm인 정사각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "14": {
        "question": "한 변의 길이가 18cm인 정오각형과 둘레의 길이가 같은 정육각형이 있습니다. 이 정육각형의 한 변의 길이는 몇 cm입니까?"
    },
    "15": {
        "question": "한 변의 길이가 21cm인 정오각형과 둘레의 길이가 같은 정칠각형이 있습니다. 이 정칠각형의 한 변의 길이는 몇 cm입니까?"
    },
    "16": {
        "question": "한 변의 길이가 40cm인 정오각형과 둘레의 길이가 같은 정팔각형이 있습니다. 이 정팔각형의 한 변의 길이는 몇 cm입니까?"
    },
    "17": {
        "question": "한 변의 길이가 27cm인 정오각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "18": {
        "question": "한 변의 길이가 6cm인 정오각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "19": {
        "question": "한 변의 길이가 21cm인 정육각형과 둘레의 길이가 같은 정칠각형이 있습니다. 이 정칠각형의 한 변의 길이는 몇 cm입니까?"
    },
    "20": {
        "question": "한 변의 길이가 24cm인 정육각형과 둘레의 길이가 같은 정팔각형이 있습니다. 이 정팔각형의 한 변의 길이는 몇 cm입니까?"
    },
    "21": {
        "question": "한 변의 길이가 21cm인 정육각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "22": {
        "question": "한 변의 길이가 20cm인 정육각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "23": {
        "question": "한 변의 길이가 24cm인 정칠각형과 둘레의 길이가 같은 정팔각형이 있습니다. 이 정팔각형의 한 변의 길이는 몇 cm입니까?"
    },
    "24": {
        "question": "한 변의 길이가 45cm인 정칠각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "25": {
        "question": "한 변의 길이가 70cm인 정칠각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "26": {
        "question": "한 변의 길이가 63cm인 정팔각형과 둘레의 길이가 같은 정구각형이 있습니다. 이 정구각형의 한 변의 길이는 몇 cm입니까?"
    },
    "27": {
        "question": "한 변의 길이가 30cm인 정팔각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    },
    "28": {
        "question": "한 변의 길이가 70cm인 정구각형과 둘레의 길이가 같은 정십각형이 있습니다. 이 정십각형의 한 변의 길이는 몇 cm입니까?"
    }
}